package org.shevtsovla.kotlincourse.lesson10

fun main() {
//Задание 1: Создание и Инициализация Массива
//Создайте массив из 5 целых чисел и инициализируйте его значениями от 1 до 5.
    val arr1 = arrayOf(1, 2, 3, 4, 5)
//Задание 2: Создание Пустого Массива
//Создайте пустой массив строк размером 10 элементов.
    val arr2 = Array(10) {}
//Задание 3: Заполнение Массива в Цикле
//Создайте массив из 5 элементов типа Double и заполните его значениями, являющимися удвоенным индексом элемента.
    val arr3 = DoubleArray(5) { 0.0 }
    for (i in arr3.indices) {
        arr3[i] = i * 2.0
    }
    println(arr3.toList())
//Задание 4: Изменение Элементов Массива
//Создайте массив из 5 элементов типа Int. Используйте цикл, чтобы присвоить каждому элементу значение, равное его индексу, умноженному на 3.
    val arr4 = Array (5) { 0 }
    for (i in arr4.indices) {
        arr4[i] = i * 3
    }
    println(arr4.toList())
//Задание 5: Работа с Nullable Элементами
//Создайте массив из 3 nullable строк. Инициализируйте его одним null значением и двумя строками.
    val arr5 = arrayOf(null, " ", "21ye")
//Задание 6: Копирование Массива
//Создайте массив целых чисел и скопируйте его в новый массив в цикле.
    val arr6 = arrayOf(12, 63, 34, 47, 8)
    val arr61 = Array(5) { 0 }
    for (i in arr6.indices) {
        arr61[i] = arr6[i]
    }
    println(arr61.toList())
//Задание 7: Разница Двух Массивов
//Создайте два массива целых чисел одинаковой длины. Создайте третий массив, вычтя значения одного из другого.
    val arr7 = arrayOf(15, 63, 489, 32 ,5)
    val arr71 = arrayOf(37, 69, 345, 12, 74)
    val arr72 = Array(5) { 0 }
    for (i in arr72.indices) {
        arr72[i] = arr7[i] - arr71[i]
    }
    println(arr72.toList())
//Задание 8: Поиск Индекса Элемента
//Создайте массив целых чисел. Найдите индекс элемента со значением 5. Если значения 5 нет в массиве, возвращаем -1. Реши задачу через цикл while.
    val arr8 = arrayOf(13, 347, -60, 43, -5)
    var i = 0
    while (i < 5) {
        if (arr8[i] == 5) {
            println(i)
            return
        }
        i++
    }
    println(-1)
//Задание 9: Перебор Массива
//Создайте массив целых чисел. Используйте цикл для перебора массива и вывода каждого элемента в консоль. Напротив каждого элемента должно быть написано “чётное” или “нечётное”.
    val arr9 = arrayOf(14, 67, 356, 119, 2)
    for (element in arr9) {
        if (element % 2 == 0) {
            println("$element “чётное”")
        } else {
            println("$element “нечётное”")
        }
    }
//Задание 10: Поиск Значения в Массиве по вхождению
//Создай функцию, которая принимает массив строк и строку для поиска. Функция должна находить в массиве элемент, в котором принятая строка является подстрокой (метод contains()). Верни найденный элемент из функции в виде строки.
    val arr10 = arrayOf("Kotlin", "is", "fun", "shit")
    val arr10String = findSubstring(arr10, "in")
    if (arr10String.isNotEmpty()) {
        println(arr10String)
    } else {
        println()
    }
}
fun findSubstring(arr10: Array<String>, searchString: String): String {
    for (element in arr10) {
        if (element.contains(searchString)) {
            return element
        }
    }
    return ""
}