package org.shevtsovla.kotlincourse.lesson11

fun main() {
//Задание 1: Создание Пустого Словаря.
//Создайте пустой неизменяемый словарь, где ключи и значения - целые числа.
    val map1 = mapOf<Int, Int>()
//Задание 2: Создание и Инициализация Словаря.
//Создайте словарь, инициализированный несколькими парами "ключ-значение", где ключи - float, а значения - double
    val map2 = mapOf(1.0f to 1.0, 1.1f to 1.1, 1.2f to 1.2)
//Задание 3: Создание Изменяемого Словаря.
//Создайте изменяемый словарь, где ключи - целые числа, а значения - строки.
    val map3 = mutableMapOf<Int, String>()
//Задание 4: Добавление Элементов в Словарь.
//Имея изменяемый словарь, добавьте в него новые пары "ключ-значение".
    map3[1] = "One"
    map3[2] = "Two"
//Задание 5: Получение Значений из Словаря.
//Используя словарь из предыдущего задания, извлеките значение, используя ключ. Попробуй получить значение с ключом, которого в словаре нет.
    println(map3[2])
    println(map3[4])
//Задание 6: Удаление Элементов из Словаря.
//Удалите определенный элемент из изменяемого словаря по его ключу.
    map3.remove(1)
//Задание 7: Перебор Словаря в Цикле.
//Создайте словарь (ключи Double, значения Int) и выведи в цикле результат деления ключа на значение. Не забудь обработать деление на 0 (в этом случае выведи слово “бесконечность”)
    val map7 = mapOf(1.0 to 1, 1.1 to 2, 1.2 to 3)
    for ((key, value) in map7) {
        val result = key / value
        if (value == 0) {
            println("бесконечность")
        } else {
            println(result)
        }
    }
//Задание 8: Перезапись Элементов Словаря.
//Измените значение для существующего ключа в изменяемом словаре.
    val map8 = mutableMapOf("1" to "One", "2" to "Two", "3" to "Three")
    map8["3"] = "Три"
//Задание 9: Сложение Двух Словарей.
//Создайте два словаря и объедините их в третьем изменяемом словаре через циклы.
    val map91 = mapOf("one" to 234, "two" to 345, "three" to 456)
    val map92 = mapOf("four" to 1, "five" to 2, "three" to 3)
    val map93 = mutableMapOf<String, Int>()
    for((key, value) in map91) {
        map93[key] = value
    }
    for((key, value) in map92) {
        map93[key] = value
    }

//Задание 10: Словарь со Сложными Типами.
//Создайте словарь, где ключами являются строки, а значениями - списки целых чисел. Добавьте несколько элементов в этот словарь.
    val map10 = mutableMapOf<String, List<Int>>()
    map10["Forward"] = listOf(1, 2, 3, 4)
    map10["Backward"] = listOf(4, 3, 2, 1)
//Задание 11: Использование Множества в Качестве Значения.
//Создай словарь, в котором ключи - это целые числа, а значения - изменяемые множества строк. Добавь данные в словарь.
// Получи значение по ключу (это должно быть множество строк) и добавь в это множество ещё строку. Распечатай полученное множество.
    val map11 = mutableMapOf<Int, MutableSet<String>>()
    map11[1] = mutableSetOf("One", "Two", "Three")
    map11[1]?.add("Four")
    println(map11[1])
//Задание 12: Поиск Элемента по Значению.
//Создай словарь, где ключами будут пары чисел. Через перебор найди значение у которого пара будет содержать цифру 5 в качестве первого
// или второго значения.
    val map12 = mapOf(Pair(1, 2) to 1, Pair(3, 4) to 2, Pair(5, 6) to 3, Pair(7, 5) to 4)
    for ((key, value) in map12) {
        if (key.first == 5 || key.second == 5) {
            println(value)
        }
    }
//Задание 6: Словарь Библиотека.
//Ключи - автор книги, значения - список книг
    val map13 = mapOf<String, MutableList<String>>()
//Задание 12: Справочник Растений.
//Ключи - типы растений (например, "Цветы", "Деревья"), значения - списки названий растений
    val map14 = mapOf<String, MutableList<String>>()
//Задание 8: Четвертьфинала.
//Ключи - названия спортивных команд, значения - списки игроков каждой команды
    val map15 = mutableMapOf<String, MutableList<String>>()
//Задание 9: Курс лечения.
//Ключи - даты, значения - список препаратов принимаемых в дату
    val map16 = mutableMapOf<String, MutableList<String>>()
//Задание 10: Словарь Путешественника.
//Ключи - страны, значения - словари из городов со списком интересных мест.
    val map17 = mutableMapOf<String, MutableMap<String, MutableList<String>>>()

}